## Eleman İşlemleri

In [149]:
import pandas as pd
import numpy as np

In [150]:
s1 = np.random.randint(10,size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10,size = 5)

In [151]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}
sozluk

{'var1': array([1, 5, 9, 6, 1]),
 'var2': array([9, 8, 2, 3, 9]),
 'var3': array([9, 5, 7, 7, 5])}

In [152]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     1     9     9
1     5     8     5
2     9     2     7
3     6     3     7
4     1     9     5

In [153]:
df[0:1]

   var1  var2  var3
0     1     9     9

In [154]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [155]:
df.index = ["a", "b", "c", "d", "e"]
df

   var1  var2  var3
a     1     9     9
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [156]:
df["c": "e"]

   var1  var2  var3
c     9     2     7
d     6     3     7
e     1     9     5

# silme işlemi

In [157]:
df.drop("a", axis = 0)

   var1  var2  var3
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [158]:
df

   var1  var2  var3
a     1     9     9
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [159]:
df.drop("a", axis = 0, inplace = True)

# fancy ile birden çok silmesilme

In [160]:
l = ["c", "e"]

In [161]:
df.drop(l)

   var1  var2  var3
b     5     8     5
d     6     3     7

In [162]:
df.drop(l, axis = 0)

   var1  var2  var3
b     5     8     5
d     6     3     7

# değişkenler için

In [163]:
"var1" in df

True

In [164]:
l = ["var1", "var4", "var2"]

In [165]:
for i in l:
    print(i in df)

True
False
True

In [166]:
df

   var1  var2  var3
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [167]:
df["var1"]

b    5
c    9
d    6
e    1
Name: var1, dtype: int32

In [168]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
b     5     8     5  0.625000
c     9     2     7  4.500000
d     6     3     7  2.000000
e     1     9     5  0.111111

# değişken silmek

In [169]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [170]:
df

   var1  var2  var3      var4
b     5     8     5  0.625000
c     9     2     7  4.500000
d     6     3     7  2.000000
e     1     9     5  0.111111

# kalıcı olarak bir değeri silmek

In [171]:
df.drop("var4", axis = 1, inplace = True)

In [172]:
df

   var1  var2  var3
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [173]:
l = ["var1", "var2"]

In [174]:
df.drop(l, axis = 1)

   var3
b     5
c     7
d     7
e     5

In [175]:
df

   var1  var2  var3
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5